Revit 2023 API
ExternallyTaggedNonBRep Constructor
 Constructs an ExternallyTaggedGeometryObject associating a given ExternalGeometryId with a particular GeometryObject.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)
Since: 2022
Syntax
C#
public ExternallyTaggedNonBRep(
	ExternalGeometryId externalId,
	GeometryObject geometry
)
Visual Basic
Public Sub New ( _
	externalId As ExternalGeometryId, _
	geometry As GeometryObject _
)
Visual C++
public:
ExternallyTaggedNonBRep(
	ExternalGeometryId^ externalId,
	GeometryObject^ geometry
)
Parameters
externalId
Type: Autodesk.Revit.DB.ExternalGeometryId
 The Id of the input geometry object.
geometry
Type: Autodesk.Revit.DB.GeometryObject
 The externally tagged geometry object.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  geometry cannot be used with an ExternallyTaggedGeometry. -or- geometry must not be a Solid.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
See Also
ExternallyTaggedNonBRep Class
Autodesk.Revit.DB Namespace